Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: <Link href="https://github.com/bluesky-social/statusphere-example-app" className="not-prose flex items-center gap-2 bg-blue-100 dark:bg-blue-950 dark:text-white px-4 py-3 text-base rounded-lg hover:underline"> <svg viewBox="0 0 20 20" aria-hidden="true" className="h-6 dark:text-white"> <path fill="currentColor" fillRule="evenodd" clipRule="evenodd" d="M10 1.667c-4.605 0-8.334 3.823-8.334 8.544 0 3.78 2.385 6.974 5.698 8.106.417.075.573-.182.573-.406 0-.203-.011-.875-.011-1.592-2.093.397-2.635-.522-2.802-1.002-.094-.246-.5-1.005-.854-1.207-.291-.16-.708-.556-.01-.567.656-.01 1.124.62 1.281.876.75 1.292 1.948.93 2.427.705.073-.555.291-.93.531-1.143-1.854-.213-3.791-.95-3.791-4.218 0-.929.322-1.698.854-2.296-.083-.214-.375-1.09.083-2.265 0 0 .698-.224 2.292.876a7.576 7.576 0 0 1 2.083-.288c.709 0 1.417.096 2.084.288 1.593-1.11 2.291-.875 2.291-.875.459 1.174.167 2.05.084 2.263.53.599.854 1.357.854 2.297 0 3.278-1.948 4.005-3.802 4.219.302.266.563.78.563 1.58 0 1.143-.011 2.061-.011 2.35 0 .224.156.491.573.405a8.365 8.365 0 0 0 4.11-3.116 8.707 8.707 0 0 0 1.567-4.99c0-4.721-3.73-8.545-8.334-8.545Z" /> </svg> <span> Find the source code for the example application on GitHub. </span> </Link>
ja: <Link href="https://github.com/bluesky-social/statusphere-example-app" className="not-prose flex items-center gap-2 bg-blue-100 dark:bg-blue-950 dark:text-white px-4 py-3 text-base rounded-lg hover:underline"> <svg viewBox="0 0 20 20" aria-hidden="true" className="h-6 dark:text-white"> <path fill="currentColor" fillRule="evenodd" clipRule="evenodd" d="M10 1.667c-4.605 0-8.334 3.823-8.334 8.544 0 3.78 2.385 6.974 5.698 8.106.417.075.573-.182.573-.406 0-.203-.011-.875-.011-1.592-2.093.397-2.635-.522-2.802-1.002-.094-.246-.5-1.005-.854-1.207-.291-.16-.708-.556-.01-.567.656-.01 1.124.62 1.281.876.75 1.292 1.948.93 2.427.705.073-.555.291-.93.531-1.143-1.854-.213-3.791-.95-3.791-4.218 0-.929.322-1.698.854-2.296-.083-.214-.375-1.09.083-2.265 0 0 .698-.224 2.292.876a7.576 7.576 0 0 1 2.083-.288c.709 0 1.417.096 2.084.288 1.593-1.11 2.291-.875 2.291-.875.459 1.174.167 2.05.084 2.263.53.599.854 1.357.854 2.297 0 3.278-1.948 4.005-3.802 4.219.302.266.563.78.563 1.58 0 1.143-.011 2.061-.011 2.35 0 .224.156.491.573.405a8.365 8.365 0 0 0 4.11-3.116 8.707 8.707 0 0 0 1.567-4.99c0-4.721-3.73-8.545-8.334-8.545Z" /> </svg> <span> サンプル アプリケーションのソースコードはGitHubで見つかります。 </span> </Link>

source: <Note> Automated bots that post to an account on an regular interval are welcome on the network. If your bot interacts with other users, please only interact (like, repost, reply, etc.) if the user has tagged the bot account. It should be an opt-in interaction, or your bot may be flagged for spam. </Note>
ja: <Note> アカウントへ定期的に投稿するボットは、このネットワークでは歓迎されています。ボットが他のユーザーとやり取りすること（いいね、リポスト、リプライなど）は、そのユーザーがボットアカウントをタグ付けしたときだけにしてください。オプトイン型のやり取りであるべきで、そうでない場合はスパムとして報告される可能性があります。 </Note>

source: <Note> Before setting up your Ozone service you should create a new account on the network, separate from your main account. This is the account that subscribers to your labeler will interact with: accounts for labelers appear differently in Bluesky than normal accounts. </Note>
ja: <Note> Ozoneサービスを設定する前に、メインアカウントとは別に、ネットワーク上に新しいアカウントを作成する必要があります。これはラベラー利用者との窓口になるアカウントです。Blueskyでは、ラベラーアカウントは通常のアカウントとは異なる表示になります。 </Note>

source: <Note> If you have been using `client-metadata.json` rather than `oauth-client-metadata.json`, you can make this change to have your domain display on the auth flow page, rather than a URL string. </Note>
ja: <Note> もし`oauth-client-metadata.json`の代わりに`client-metadata.json`を使用している場合、この変更により認可フローのページでURL文字列ではなくドメインを表示させることができます。 </Note>

source: <Note> If you're using `pnpm` as a package manager as suggeseted here, you should create a file called `pnpm-workspace.yaml` in the root of your project with the following content to ensure `better-sqlite3` is built correctly in the next step:
ja: <Note> 推奨通り`pnpm`をパッケージマネージャーとして使用している場合は、次のステップで`better-sqlite3`が正しくビルドされるように、次の内容を含む`pnpm-workspace.yaml`というファイルをプロジェクトのルートに作成する必要があります。

source: <Note> In general, when working with OAuth, you should use `127.0.0.1` URLs instead of `localhost`. This will be important for the OAuth redirect flow to work correctly. </Note>
ja: <Note> 一般に、OAuthを使用する場合は「localhost」ではなく「127.0.0.1」のURLを使用する必要があります。これは、OAuthリダイレクトフローが正しく機能するために重要です。 </Note>

source: <Note> Note that you'll need to [blank import](https://www.oreilly.com/library/view/the-go-programming/9780134190570/ebook_split_100.html) the `bsky` and `util` libraries if you aren't using them directly, due to the way Go imports work:
ja: <Note> Goインポートの仕組み上、`bsky`ライブラリと`util`ライブラリを直接使用していない場合は、これらを[空インポート](https://www.oreilly.com/library/view/the-go-programming/9780134190570/ebook_split_100.html)する必要があることに注意してください。

source: <Note> Remember that this example fetches only a single user's data repository. To fetch the entire network, stop and re-run `tap` with the `--signal-collection` flag:
ja: <Note> この例では単一ユーザーのデータリポジトリだけを取得している点に注意してください。ネットワーク全体を取得するには、`tap`を停止して`--signal-collection`フラグ付きで再実行します。

source: <Note> The Python example does not use an SDK! It may be useful as reference when building an OAuth SDK from scratch, alongside the advanced [OAuth client implementation guide](https://docs.bsky.app/docs/advanced-guides/oauth-client) </Note>
ja: <Note> PythonのサンプルではSDKを使用していないことに注意してください。[OAuthクライアント実装ガイド](https://docs.bsky.app/docs/advanced-guides/oauth-client)と共に、OAuth SDKを一から構築する際の参考として役立つかもしれません。 </Note>

source: <Note> The behavior of downstream services is a recurring theme throughout this guide. Due to the nature of the AT Protocol, downstream services may go out of sync with [firehose events](/guides/streaming-data), and may fail to process requests such as deletion requests. Records that have been requested to be deleted, or have been removed from a self-hosted PDS, may still exist elsewhere if they were processed by a Relay and ingested into another application or data model that does not follow the AT Proto spec — i.e., doesn't resolve record requests back to the origin PDS. Full records are [deliberately not included](https://github.com/bluesky-social/indigo/issues/927) with delete events on the firehose to further mitigate this. As a rule, the PDS *should* be considered the source of truth for hosted accounts. </Note>
ja: <Note> 下流サービスの挙動はこのガイドで繰り返されるテーマです。ATプロトコルの性質上、下流サービスは[firehoseイベント](/guides/streaming-data)による同期がずれたり、削除要求の処理に失敗することがあります。削除が要求されたりセルフホストPDSで削除されたレコードであっても、リレーに処理されて別のアプリケーションやATプロトコル外のデータモデルに取り込まれた（つまり、レコード要求を元のPDSまで解決しない）場合、まだどこかに存在しているかもしれません。この問題をなるべく緩和するために、firehose上の削除イベントには完全なレコードは[意図的に含まれていません](https://github.com/bluesky-social/indigo/issues/927)。原則としてPDSは、ホストされているアカウントの信頼できる情報源であるとみなされる*べき*です。 </Note>

source: <Note> There's no way around it — this section of the tutorial is pretty dry! You'll be implementing standard OAuth flows, which are inherently boilerplate-heavy. But once you have this baseline working, you'll be able to build on top of it! </Note>
ja: <Note> これは避けられないことですが、チュートリアルのこのセクションはかなり無味乾燥なものです。標準のOAuthフローを実装することになりますが、これは本質的に定型的な負荷がかかります。ただし、このベースラインが機能すると、その上に構築できるようになります。 </Note>

source: <Note> This cursor is treated as an opaque value and fully at the Feed Generator's discretion. It is passed through the AppView directly to and from the client. The cursor be _unique per feed item_ to prevent unexpected behavior in pagination. For instance, a compound cursor with a timestamp + a CID: `1683654690921::bafyreia3tbsfxe3cc75xrxyyn6qc42oupi73fxiox76prlyi5bpx7hr72u` </Note>
ja: <Note> このカーソルは不透明な値として扱われ、実装はフィードジェネレーター側に完全に委ねられます。AppViewはこの値をクライアントとの間でそのまま中継します。ページネーション時の予期しない挙動を防ぐため、カーソルは*各フィード項目に対して一意*である必要があります。例えば、次のようなタイムスタンプとCIDを組み合わせたカーソルです。 `1683654690921::bafyreia3tbsfxe3cc75xrxyyn6qc42oupi73fxiox76prlyi5bpx7hr72u` </Note>

source: <Note> This will post using the currently-authenticated user session. If you want to post as another user, reuse [`ServerCreateSession()`](/guides/sdk-auth#creating-a-client) to get a new user session. </Note>
ja: <Note> これはその時点で認証しているユーザーセッションで投稿します。別のユーザーとして投稿したい場合、再度[`ServerCreateSession()`](/guides/sdk-auth#creating-a-client)を呼んで新規セッションを取得してください。 </Note>

source: <Note> This will post using the currently-authenticated user session. If you want to post as another user, reuse [`agent.login()`](/guides/reads-and-writes#creating-a-client) to get a new user session. </Note>
ja: <Note> これはその時点で認証しているユーザーセッションで投稿します。別のユーザーとして投稿したい場合、再度[`agent.login()`](/guides/reads-and-writes#creating-a-client)を呼んで新規セッションを取得してください。 </Note>

source: <Note> We also support the use of [App Passwords](/specs/xrpc#app-passwords). Accounts can create and revoke app passwords separate from their primary password. This way, you do not need to supply your primary password to applications that use password auth. </Note>
ja: <Note> 私たちは[アプリパスワード](/specs/xrpc#app-passwords)の使用もサポートしています。アカウントは主パスワードとは別にアプリパスワードの作成・取消しができます。これにより、パスワード認証を使うアプリケーションに主パスワードを渡す必要がありません。 </Note>

source: <Note> You could add this command to `package.json` if you needed, but we won't be using it again in this tutorial now that our Lexicons have been built. If you ever add another Lexicon to a project with `lex install`, you'll need to re-run `lex build` with the `--override` flag to regenerate the types. </Note>
ja: <Note> 必要に応じてこのコマンドを`package.json`に追加することもできますが、Lexiconがビルドできたので、このチュートリアルではもう使用しません。 `lex install`を使用して別のLexiconをプロジェクトに追加した場合は、`--override`フラグを指定して`lex build`を再実行することで型を再生成する必要があります。 </Note>

source: <Note> The behavior of downstream services is a recurring theme throughout this guide. Due to the nature of the AT Protocol, downstream services may go out of sync with [firehose events](/guides/streaming-data), and may fail to process requests such as deletion requests. Records that have been requested to be deleted, or have been removed from a self-hosted PDS, may still exist elsewhere if they were processed by a Relay and ingested into another application or data model that does not follow the AT Proto spec — i.e., doesn't resolve record requests back to the origin PDS. Full records are <a href="https://github.com/bluesky-social/indigo/issues/927" target="_blank">deliberately not included</a> with delete events on the firehose to further mitigate this. As a rule, the PDS *should* be considered the source of truth for hosted accounts. </Note>
ja: <Note> 下流サービスの挙動はこのガイドで繰り返されるテーマです。ATプロトコルの性質上、下流サービスは[firehoseイベント](/guides/streaming-data)による同期がずれたり、削除要求の処理に失敗することがあります。削除が要求されたりセルフホストPDSで削除されたレコードであっても、リレーに処理されて別のアプリケーションやATプロトコル外のデータモデルに取り込まれた（つまり、レコード要求を元のPDSまで解決しない）場合、まだどこかに存在しているかもしれません。 </Note>

source: <ResponsiveTable columns={[{label: 'Example App'}, {label: 'Language'}, {label: 'SDK'}, {label: 'Architecture'}, {label: 'Confidential Client?'}, {label: 'Localhost development client ID?', href: '/specs/oauth#localhost-client-development'}]} rows={[ [{label: 'cookbook/react-native-oauth', href:' https://github.com/bluesky-social/cookbook/tree/main/react-native-oauth#readme' }, {label: 'TypeScript'}, {label: '@atproto/oauth-client-expo'}, {label: 'Mobile App (no backend)'}, {label: 'No'}, {label: 'No (requires hosted client metadata)'},], [{label: 'cookbook/vanillajs-oauth-web-app', href:' https://github.com/bluesky-social/cookbook/tree/main/vanillajs-oauth-web-app#readme' }, {label: 'JavaScript'}, {label: '@atproto/oauth-client-browser'}, {label: 'Web SPA (no backend)'}, {label: 'No'}, {label: 'Optionally'},], [{label: 'cookbook/go-oauth-web-app', href:' https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme' }, {label: 'Go'}, {label: 'indigo'}, {label: 'Web BFF'}, {label: 'Optionally'}, {label: 'Optionally'},], [{label: 'cookbook/go-oauth-cli-app', href:' https://github.com/bluesky-social/cookbook/tree/main/go-oauth-cli-app#readme' }, {label: 'Go'}, {label: 'indigo'}, {label: 'Native CLI'}, {label: 'No'}, {label: 'No (requires hosted client metadata)'},], [{label: 'cookbook/python-oauth-web-app', href:' https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme' }, {label: 'Python'}, {label: 'None'}, {label: 'Web BFF'}, {label: 'Optionally'}, {label: 'Optionally'},] ]} />
ja: <ResponsiveTable columns={[{label: 'サンプルアプリ'}, {label: '言語'}, {label: 'SDK'}, {label: '構成'}, {label: '機密'}, {label: 'ローカル', href: '/specs/oauth#localhost-client-development'}]} rows={[ [{label: 'cookbook/react-native-oauth', href:' https://github.com/bluesky-social/cookbook/tree/main/react-native-oauth#readme' }, {label: 'TypeScript'}, {label: '@atproto/oauth-client-expo'}, {label: 'モバイルアプリ（バックエンドなし）'}, {label: '非対応'}, {label: '非対応（ホストされたメタデータが必要）'},], [{label: 'cookbook/vanillajs-oauth-web-app', href:' https://github.com/bluesky-social/cookbook/tree/main/vanillajs-oauth-web-app#readme' }, {label: 'JavaScript'}, {label: '@atproto/oauth-client-browser'}, {label: 'Web SPA（バックエンドなし）'}, {label: '非対応'}, {label: '選択可'},], [{label: 'cookbook/go-oauth-web-app', href:' https://github.com/bluesky-social/cookbook/tree/main/go-oauth-web-app#readme' }, {label: 'Go'}, {label: 'indigo'}, {label: 'Web BFF'}, {label: '選択可'}, {label: '選択可'},], [{label: 'cookbook/go-oauth-cli-app', href:' https://github.com/bluesky-social/cookbook/tree/main/go-oauth-cli-app#readme' }, {label: 'Go'}, {label: 'indigo'}, {label: 'ネイティブCLI'}, {label: '非対応'}, {label: '非対応（ホストされたメタデータが必要）'},], [{label: 'cookbook/python-oauth-web-app', href:' https://github.com/bluesky-social/cookbook/tree/main/python-oauth-web-app#readme' }, {label: 'Python'}, {label: 'None'}, {label: 'Web BFF'}, {label: '選択可'}, {label: '選択可'},] ]} />

source: <Specs />
ja: <Specs lang="ja" />

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> Use the [lex-server](https://github.com/bluesky-social/atproto/tree/main/packages/lex/lex-server) package:
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> [lex-server](https://github.com/bluesky-social/atproto/tree/main/packages/lex/lex-server)パッケージを使います。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> Once you have a logged-in `agent`, you can create a `Client` instance to read and write data:
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> ログインした`agent`が取得できたら、`Client`インスタンスを作成してデータの読み書きができます。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> Start by importing `PasswordAgent`, providing credentials to `PasswordAgent.login()`, and creating an `agent`:
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> `PasswordAgent`をインポートし、`PasswordAgent.login()`に資格情報を与えて`agent`を作るところから始めましょう。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> The first step when working with AT data is authenticating. You can authenticate using any [OAuth](/guides/auth) provider, or with [PasswordAgent](https://github.com/bluesky-social/atproto/tree/main/packages/lex/lex-password-agent) from our SDK if you are using password auth.
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> ATデータを扱う最初のステップは認証です。任意の[OAuth](/guides/auth)プロバイダを使用して認証することもできますし、パスワードを使う場合はSDKの[PasswordAgent](https://github.com/bluesky-social/atproto/tree/main/packages/lex/lex-password-agent)を使用して認証することもできます。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> To make API requests, you'll need to specify a particular [Lexicon](/guides/lexicon). For example, Bluesky posts are available under the `app.bsky.feed.post` Lexicon.
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> APIリクエストを行うには、特定の[Lexicon](/guides/lexicon)を指定する必要があります。例えば、Blueskyの投稿は`app.bsky.feed.post` Lexiconで提供されます。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> You can read records from a user's data repository with `client.list()`:
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> `client.list()`を使用してユーザーのテータリポジトリからレコードを読み取ることができます。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> You can use `client.get()` to read an individual record by its [`rkey`](/specs/record-key):
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> `client.get()`を使用して、[`rkey`](/specs/record-key)で個別レコードを読み取ることができます。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> To create a new record, call `client.create()` with an imported Lexicon, along with any required fields:
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> 新しいレコードの作成には、Lexiconをインポートした`client.create()`に必要なフィールドを添えて呼び出します。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> To delete a record, like an individual post, use `client.delete()`:
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> 個々の投稿などのレコードを削除するには、`client.delete()`を使用します。

source: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> To update an existing record, like a user's profile, use `client.put()`:
ja: <TabGroup defaultValue="ts"> <TabList> <Tab value="ts">TypeScript</Tab> <Tab value="go">Go</Tab> </TabList> <TabPanels> <TabPanel value="ts"> ユーザーのプロフィールなど既存のレコードを更新するには、`client.put()`を使用します。

source: <a href="https://stream.place/docs/" target="_blank">Streamplace</a> provides an implementation and related Lexicon for video streaming on ATProto.
ja: <a href="https://stream.place/docs/" target="_blank">Streamplace</a>はATプロトコル上の動画ストリーミングの実装および関連Lexiconを提供します。

source: <a href="https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw743ejno722" target="_blank">Video Service</a>
ja: <a href="https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw743ejno722" target="_blank">ビデオサービスを使う方法</a>

source: <a href="https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw74be4dr422" target="_blank">Simple Method</a>
ja: <a href="https://tangled.sh/strings/did:plc:p2cp5gopk7mgjegy6wadk3ep/3lw74be4dr422" target="_blank">簡単な方法</a>

source: <div className="not-prose mb-16 mt-6 flex gap-3"> <Button href="/guides/applications" arrow="right"> <>Quickstart</> </Button> <Button href="/sdks" variant="outline"> <>Explore SDKs</> </Button> </div>
ja: <div className="not-prose mb-16 mt-6 flex gap-3"> <Button href="/guides/applications" arrow="right"> <>クイックスタート</> </Button> <Button href="/sdks" variant="outline"> <>SDKを調べる</> </Button> </div>

source: > ### Why create a schema? > > Schemas help other applications understand the data your app is creating. By publishing your schemas, you make it easier for other application authors to publish data in a format your app will recognize and handle.
ja: > <Heading level={3} id="why-create-a-schema">スキーマを作成する理由</Heading> > > スキーマは、アプリが作成するデータを他のアプリケーションが理解するのに役立ちます。スキーマを公開することで、他のアプリケーション作成者もデータをあなたのアプリが認識して処理できる形式で公開しやすくなります。

source: > `at://` is the URL scheme of the AT Protocol. Under the hood it uses common tech like HTTP and DNS, but it adds all of the features we'll be using in this tutorial.
ja: > `at://`はATプロトコルのURLスキームです。内部的にはHTTPやDNSなどの一般的な技術を使用していますが、このチュートリアルで使用するすべての機能が追加されています。

source: A "record" is a JSON document inside a [repo](#data-repo) [collection](#collection). The type of a record is identified by the `$type` field, which is expected to map to a [Lexicon](#lexicon) schema. The type is also expected to match the [collection](#collection) which contains it.
ja: 「レコード」は、[リポジトリ](#data-repo)の[collection](#collection)内のJSONドキュメントです。レコードの型は`$type`フィールドによって識別され、[Lexicon](#lexicon)スキーマにマッピングされることが期待されます。また、型はそのレコードを含む[collection](#collection)と一致することが期待されます。

source: A CAR file can be imported to the new PDS using the authenticated `com.atproto.repo.importRepo` endpoint.
ja: 認証付きで`com.atproto.repo.importRepo`エンドポイントを使って、CARファイルを新しいPDSにインポートできます。

source: A Feed Generator service can host one or more algorithms. The service itself is identified by DID, while each algorithm that it hosts is declared by a record in the repo of the account that created it. For instance, feeds offered by Bluesky will likely be declared in `@bsky.app`'s repo. Therefore, a given algorithm is identified by the at-uri of the declaration record. This declaration record includes a pointer to the service's DID along with some profile information for the feed.
ja: フィードジェネレーターサービスは1つ以上のアルゴリズムをホストできます。サービス自体はDIDで識別され、ホストする各アルゴリズムはそれを作成したアカウントのリポジトリ内のレコードで宣言されます。例えば、Blueskyが提供するフィードは`@bsky.app`のリポジトリで宣言されるでしょう。したがって、特定のアルゴリズムは宣言レコードのat-uriで識別されます。この宣言レコードには、サービスのDIDへのポインターとフィードのプロフィール情報が含まれます。

source: A Jetstream server consumes from the firehose and fans out to many subscribers. It is [open source](https://github.com/bluesky-social/jetstream), implemented in Go, simple to self-host. There is an official client library included (in Go), and [community client libraries](https://skyware.js.org/guides/jetstream/introduction/getting-started/) have been developed.
ja: Jetstreamサーバーはfirehoseを受け取り、多くの利用者に配信します。[オープンソース](https://github.com/bluesky-social/jetstream)で、Goで実装されており、セルフホストが簡単です。公式Goクライアントライブラリがあり、[コミュニティクライアントライブラリ](https://skyware.js.org/guides/jetstream/introduction/getting-started/)も開発されています。

source: A PDS communicates with [AppViews](#app-view) to run applications. A PDS doesn't typically run any applications itself, though it will have general account management interfaces such as the OAuth login screen. PDSes actively sync their [data repos](#data-repo) with [Relays](#relay).
ja: PDSは[AppView](#appview)と通信してアプリケーションを実行します。PDSは通常、それ自体ではアプリケーションを実行しませんが、OAuthログイン画面などの一般的なアカウント管理インターフェイスを備えています。PDSは[データリポジトリ](#data-repo)を[リレー](#relay)と積極的に同期します。

source: A PDS, or Personal Data Server, is a server that hosts a user. A PDS will always store the user's [data repo](#data-repo) and signing keys. It may also assign the user a [handle](#handle) and a [DID](#did-decentralized-id). Many PDSes will host multiple users.
ja: PDS（パーソナルデータサーバー）は、ユーザーをホストするサーバーです。PDSは常にユーザーの[データリポジトリ](#data-repo)と署名鍵を保存します。また、ユーザーに[ハンドル](#handle)と[DID](#did-decentralized-id)を割り当てることもあります。多くのPDSは複数のユーザーをホストします。

source: A PDS, or Personal Data Server, is a server that hosts users' individual data repositories, such as posts, followers, and profile information. The PDS handles account lifecycle features, identity management, and key resolution for hosted user accounts.
ja: PDS（パーソナルデータサーバー）は、ユーザー個々人のデータリポジトリ（投稿、フォロワー、プロフィール情報など）をホストするサーバーです。PDSは、ホストされたユーザーアカウントのアカウントライフサイクル機能、アイデンティティ管理、および鍵解決を処理します。
